Revit 2026 API

# ExportIFCCategoryInfo Properties

---

The ExportIFCCategoryInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCEntityName | The name of the IFC entity mapped to a particular Revit category. |
|  | IFCExportFlag | The boolean value that indicates whether the category is exported to IFC. |
|  | IFCPredefinedType | The name of the predefined type mapped to a particular Revit category. |
|  | IFCPresentationLayerName | The name of the presentation layer mapped to a particular Revit category. |
|  | IFCUserDefinedType | The name of the user-defined type mapped to a particular Revit category. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ExportIFCCategoryInfo Class

Autodesk.Revit.DB Namespace